water/pipe_heatExchg_buoyantPimple/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            fixedFluxPressure;
        value           uniform 1e5;

    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform 1e5;

    }
}

// ************************************************************************* //
